[["Who's money is on the table?", "Disai do siin iti sid mija diti?"], ["Please pour some water in this bamboo container, I want to drink.", "Ihibai poka do vaig iti sangit, inumon ku."], ["The sun is swallowed by the Tarob.", "Tinolon do tarob ilot addau."], ["I just finish a cup of coffee.", "Sansangkil o kupi navi ku monginum dino no."], ["Orong mouth is full with cookies.", "Nababol do kinulat ilo munung di Orong."], ["Let your child sleep at the swing.", "Podopo sid dazung inot anak nu."],
["I don't have the strength to climb Mt. Kinabalu.", "Omu oku kogoos tumakad do Nabalu."], ["The dog has many puppies.", "Ogumu anak dilot asu."], ["My baby finger is hurt because a crab pinch it.", "Oruol iti angkakis ku, noongipan do kabou."], ["Idot's househelp is from Indonesia.", "I kinambo di Idot, ulun antad sori ponong Indon."], ["The young men of Montuson are all very strong!", "Anakvagu do Montuson ongokakansang!"], ["Put the book inside your bag.", "Posuvango ino buuk sid juli nu."], ["Worm as lure is the best for rod-fishing.", "Lingguvang bo buzazat magapon dot odukon."], ["He is bald.", "Aso obuk di aki nu, butul.Your grandfather dosen't have hair."], ["Grandpa is bald, he shave his head.", "Gundul no i aki, sinukul dau it ulu dau."], ["I threw a ball of paper at him.", "Pinilai ku yalo do binulugu do karatas."], ["We can't play football, our ball deflated.", "Nakampis iti bula di tokou, amu tokou no kopimomoi diti."], ["We go and cut down bamboo tree on the afternoon.", "Managad kito do vulu ong minsosodop."], ["I forgot to plant my shoot of the padang banana.", "Nolingan ku mananom i sakat ku do padang."], ["The api-api is not ripe yet.", "Amu po mansak ilo api-api."], ["The baba banana is ripe, it is very aromatic.", "Mansak no ilo baba, ovongi ogi."], ["Do you want to eat banana?", "Mangakan ko ka do torosok?"], ["Put the bird inside the cage.", "Posuvango sid tongkurung inot ombolog."], ["The buffalo's baby was escaped.", "Nakalabus it uzog do karabau."], ["My calf biten by a dog.", "Nokokot dot asu iti votis ku."], ["The new nurse at that clinic call me as sister.", "Ilo naas vagu silod kolinik dilo manangaka dohon."], ["Norika's step childrens now knows to call him as a dad.", "Karaharti noma manangama di Norika ilot angaanak do nosingkapu dau."], ["Can you reach the basket?", "Orikot nu-i ka monivol ilo raga dilo?"], ["Can you see at the back?", "Kemot ko-i ka sinod tohudi?"], ["There is an abnormal growth on my arm.", "Varo nanakan sid longon ku."], ["There is a cannon during war at the museum.", "Varo bajil do hiza mononjipun po ong sid mozium."], ["My father dosen't health enough.", "Amu ali-ali it ama ku."], ["Dagger is sharp.", "Atarom ong baladou."], ["It's cold to wear this shirt, because it is damp.", "Osogit banaton iti banat tu adamil."], ["Dance with your husband!", "Andak dilo savo nu sumundai."], ["Do you dare swim across the river?", "Kobulun ko ka mintozog mitupak dot olungan?"], ["It's getting dark and they still haven't returned from the fields. Why ever not?", "Mimbabarou no, nga aso koulian dioti antad sid tagad. Nokuro ma?"], ["The cloud is dark, it will be raining.", "Dumarun dati iti tu akapal ino mituvong."], ["What is the date today?", "Nunu aribulan addau biano?"], ["This is only the second day after what's-is-name's death.", "Addau koduvo ogi kinapatazan di kuvo biano."], ["How many days is your boss paying you for to harvest?", "Piro ot inaddahan ka do mangagaji i bos mongomot?"], ["The chick is dead. What happened?", "Minatai ilo pizak. Nokuro ino?"], ["Are you deaf? You not listening when be calling.", "Bongung ko ka tu amu korongou ko kodimon."], ["You argue so much when people advised you.", "Ogumu ma dahava ong ikau o barasan to."], ["Let's put this rotten wood on the wood burning pile.", "Ino robuk do kazu ot isudu ong muapui no."], ["Dont refuse to take it if given money. Just take it!", "Kadan no mangamu ong tahankan do siin, onuvon-i."], ["Walk at the front if you holding a torch.", "id gulu mamanau ong kikinavid do sotirip."], ["Use your ears to hear.", "Ponginingon ino pinalung."], ["I finished planting all my land with coconut trees.", "Notongkop ku no mananom do nizuw i tana ku."], ["Housework has become easy now that we have piped water in the house.", "Adavasi no minggama-gama ong biano no tu kipaip no sid valai."],["The sun is nearly set.", "Oruhai nom tumonob ilot mato dot addau."], ["Its easy to make that fish trap if you know how to do it.", "Oruhai mangagama dino bubu dino ong elo ogi."], ["Do you eat sauerkraut?", "Mangakan ko ka do sinamu?"], ["Sit, all of you, lets eat!", "Ogom kou, mongogulon tokou."], ["Eat, I'm sure you are hungry.", "Akan no, vitilon ko dino."], ["Eat until you satisfy your hunger.", "Vizahon no bo ong makan."], ["Kodili is gobbling up his food, he must be hungry!", "Mamabut no i Kodili makan, vitilon banal naku yosido."], ["I want to make buisness, where is your toilet?", "Tuami oku po, siombo tandas dikou?"], ["I am drunk. They gave me drink rice wine at the neighbourhood.", "Avuk oku diti. Nenum oku dioti do lihing sid sombol."], ["She fainted at the road because of the hot weather.", "Novunusan yalo sid tanga ralan tu kalasu dot addau."], ["Faith that you belief will make you live.", "I kosipan dot abanal o kapasi penlaid."], ["This old house is falling apart because it's stilts are rotten.", "Humuzas no iti pogun do valai diti tu ongorobuk no itit origi dau."], ["Gather the battlenut fruit that fallen from the tree.", "Puruto ilo loho dot inggaton."], ["Galangal is spicy as a ginger.", "Opodos ong longuas yadko lazo."], ["Let us go to the church this Sunday.", "Sumambayang tokou po ong minggu."], ["What gender is your new baby born?", "Nunu no soluvon dit anak nu di kosino?"], [" would like to take your puppy if you willing to give it to me.", "Onuvon ku ino duku dikou ong kozuan dikou patahak.I"], ["Its norm to old people.", "Dadan do lumohing no, amu tantu korongou ong pibabarasan."], ["Please take the hammer. I want to knock the nail.", "Onuvo dikou i dunsul. Pongodunsul ku dilo paku do nokotulai."], ["Knock the nail harder so that the nail will go deep faster.", "Lagad-lagadan mongodunsul ino paku dino nga katisop koduruk."], ["My wrist is hurt, why is it?", "Oruol iti lunggazan ku diti, nokokuro ma?"], ["This sweater is woven by my grandmother.", "Inavol dit oduon ku iti banat ku diti."], ["Let's do some hand wrestling, to see which of us is the strongest.", "Mibilad kito kai, isai dikito do banalko ahakang."], ["Hang on with the guava branches.", "Ginit no sinod raan do koliabas."], ["What happened to him on the way?", "Nunu o nabambaran dau sid tanga do vazaan?"], ["I am a poor person.", "Yoku diti ulun do mosikim."], ["As for me, I am a son of Bagu, said Bandis.", "Yoku nobo diti, anak di Bagu, ka di Bandis."], ["I will cook for myself if I am hungry.", "Yoku kondiri o magazau ong vitilon oku no."], ["Put the fish inside the refrigerator or it will rotten.", "Posuvango inot sada silod aisbuk tu masa dati."], ["Your siblings look identical. I can't recognise well each of you.", "Miluu kou songobpinai mai. Mad, amu osodirizan ku ikou."], ["That's why I don't eat chilli, because if I do, I get bad heart-burn.", "Sabap pogi om amu mangakan oku do lada, husukon oku ong koponosok oku no."], ["Go meet with YB, maybe he will give you money.", "Samung kou di YB, kaluto ong manahak yalo do siin."], ["He is ignorant, because he has been to the city only once so far.", "Sakai ong yalo tu insan ogi kosirid bandal."], ["What are you sick with that you can't walk?", "Nunu ka sakit nu tu amu ko kapanau?"], ["I imagining that I am rich.", "Monorou oku po do lumundu oku."], ["I imagine that you miss me.", "Osorou ku do langadon ko dohon."], ["Imagine me if you miss me.", "Soroho oku no ong langadon ko dohon."], ["I would like to imatate her in making a breads.", "Mamit oku dialo monuluw tinggol."], ["Sikob's son is naughty. He stole.", "Obungou ko ulun ong anak di Sikob, manakau."], ["We call a woman immoral, if she always runs around with men she is not married to.", "Akahag o pongoretan ong ondu do songkovozoo do kusai dot okonko savo dau."], ["Just stay in your room if you don't want to go.", "Obong sinod ongkob ong malan ko no mamanau."], ["If in case we went to Kudat, leave me the money for the electric bill payment.", "Kalu ong kosunu okoi Kumudat, opungai oku laid do siin pamayal ku dino karan tokou."], ["Go meet with YB, mmaybe he will give you money.", "Samung kou di YB, kaluto ong manahak yalo do siin."], ["Its danger cycling oin the road!", "Kopunovot mahi mimbasikal sid alun-alun!"], ["I am in difficulty this time because my children is sick.", "Osusaan oku ginavo didino diti tu sumakit it anak ku."], ["Today is the date where i actually meet my doctor.", "Biano bala i jumumpa oku do dokutul diri."], ["People who do wrong, will go to jail.", "Isai nasala, kosuvang sid torungku."], ["Adi has no work, he sleeps the whole time.", "Aso gagamaon di Adi, bai modop nopo."], ["Don't join them playing if they cry easily.", "Kadan no mamung mimomoi ong obogihad ko ulun."], ["Join us because we are just a few.", "Amung siti dahai tu okudik ong yokoi."], ["I fell so happy because father are healed.", "Higak sid ginavoku tu nolingasan no Yama do sakit."], ["Look, the monkey jumping to the tree.", "Hodi, modtopik ilo kara silod kazu."], ["Modtopik yara silod kazu.", "The monkey jumping at the tree."], ["Jump to this guava branchess.", "Topik sitid raan do koliabas."], ["He is jumping up and down while crying.", "Magandak no yalo mogihad."], ["Hop, don't just stand there.", "Andak, kadan bai pengkakat sino."], ["Jump in if you want to take a bath.", "Tuhop no siti ong modsu ko no."], ["Look at the monkey jumping from branch to branch.", "Imatai dikou ilo kara modturopik."], ["This jungle fruit is sour.", "Onsom ong iti bambangan."], ["The kids are so happy running at the yard.", "Ohigak ogi ilot angaanak santangkus silod natad."], ["I wanna watch them slaughter the buffalo.", "Mimot oku po dioti mangagaraas dilo karabau."], ["What kind was that plant that is good for the stomach as a medicine?", "Nunu ka gingis di kazu do koubat do tizan diri?"], ["I'm craving for this special rice at the moment.", "Tiakan oku lumansat ong iti."], ["Your wedding goun is full of lace.", "Ogumu banal do rinda ino banat nu mogontong."], ["Carefull at the stairs because its maybe slipery.", "Atagon no sinod tukad tu alamou mahi ino."], ["Sit on the floor if you want to eat.", "Sondot mogom-ogom ong makan ko."], ["The plane is landing.", "Sumondot no ilo tarabang."], ["The road to Ranau was washed away because of heavy rain.", "Nozuzu it alun-alun kumaa sid Ranau tu kologod do darun."], ["Welson's house was hit by a landslide.", "Nantakan do zuzu i valai di Welson."], ["Today is the last day we harvesting paddy, as only small areas leaf not been harvested yesterday.", "Kovian no mongomot biano tu opodok no it omoton nobi mongomot konihab."], ["For now we better cope with eating chilli, because we have grilled sting ray for the side-dish.", "Sumakap po mangakan do lada ong biano tu tinunuvan pahi ot ikana."], ["You shit too long.", "Alaid banal tumai ong ikau."], ["Wake up! Or you would late to school.", "Posik no! Eduan ko di sumikul ko."], ["I was left alone in the boat, he was in the water. So I thought If my husband doesn't manage to get back up into the boat I'd better jump into the water, too! I said.", "Iseso oku po sid alud, yosido sid saralom do vaig. Na ka di ginavo ku, Ong aso no koindakadan di kuvoon dino, osuhul ong tumuhop oku diti, ka di ginavo ku."], ["Many macaque at the swamp.", "Ogumu gobuk sid katangaran."], ["I would like to eat a grilled corn at the farm.", "Tiakan oku linugu dalai sid tagad ong iti."], ["Plant some pumpkin at your small field.", "Tanamai labuk ino gopu nu."], ["I'll first do my work, then I'll sleep.", "Mangagama oku po di karaja ku, om modop oku ogi."], ["Human beings only get to eat if they work hard.", "Suvaiko aparu gumama om kakan ogi ong riniba."], ["Work hard at it, this isn't just for fun!", "Gumama no banal, okonko bai humangi."], ["Your nail is so long and its black.", "Rinaru sondulu nu diti, etom po kagi."], ["Who is your name?", "Isai ngaran nu?"], [" I named you, Mosong.", "Pungaranan ku ikau dot i Mosong."], ["He have a nasal sounding of voice.", "Dongot ong yalo bala dino."], ["Sikob's son is naughty. He stole.", "Obungou ko ulun ong anak di Sikob, manakau."], ["I am going near, don't you wanna follow me?", "Osomok oku diti, a-ka mozo ko dohon?"], ["Sit near me if you want me to feed you.", "Siti kod somok ku ong mokisuvu kono."], ["I sit near by grandma at verandah.", "Tiumoning oku di odu mogom sid tingkang."], ["The key is under the table.", "Sid siba do mija i kunsi."], ["Without a paddle, how can we row home?", "Ong aso gagau, kuran tokou mingalud muli?"], ["The flour is made from wheat.", "Ino tapung dino gandum o ginama."], ["Onoi's husband is someone who obedient.", "Obozigi mang ilo savo di Onoi oi."], ["Listen and obey when someone give you an advise.", "Mangasip no ong barasan."], ["Yoboi get catch an octopus in the stone hole when we are at the sea.", "Nakanu Yoboi do poliputan sid luvang do vatu i sid rahat okoi."], ["Today is the date where i actually meet my doctor.", "Biano bala i jumumpa oku do dokutul diri."], ["Of course he only wants to make people laugh.", "Andang ko bai ponugirak ong yalo dino dot ulun."], ["Maslina's husband is short and stocky person.", "Ahadtong koulun mang ilo savo di Maslina dino."], ["You have a bass sound when you are singing.", "Obohog ino dolou nu ong mindolongoi ko no."], ["Take what Onong gave to you.", "Romito ilo itunui di Onong si dikau."], ["Oh dear! I forget to bring my purse, Inai said.", "Aiyah! Nolingan ku mongovit i pongizanan ku siiin, ka di Inai."], ["All right, if that the case then I do agree.", "Ba, ong yad dino, mangakun oku-i."], ["Do you know how to row?", "Elo ko noka gumau dino?"], ["The women start planting hill rice, as soon as the planting constellation is in the the zenith.", "It ongoondu mamangasok no ong sumakai no i pangasakan."], ["Galong car is red in colour.", "Aragang o sahat kurita di Galong."], ["Where is the other pair of your slippers?", "Siombi antom diti soripal nu?"], ["Cook the edible palm heart with the chicken wings.", "Toduko ilo tivak do nizuw, avahai dilot alad do manuk."], ["I would like to eat one.", "Mangagama oku po do tinopis, tiakan oku.I will cook pancake."], ["The cause of his death is his pancreass unfunctional.", "I kinapatazan dialo diri, napasa it arip dau ka."], ["You always scold your child.", "Sumul mogoduw dot anak ong ikau."], ["I asking you, who is your name?", "Mongoduat oku dikou, isai ngaran nu?"], ["Ask the teacher if you have something that you don't know.", "Duat silod sigu hodi ong varo not amu elaan nu."], ["Give me a rug to wipe the spilled water.", "I gansing positio dikou, pangalap ku dinot vaig do nuza."], ["The rain is heavy this afternoon until the river is overflow.", "Asapou darun di minsosodop sampai nakalampai i bavang."], ["Ranibow is beautiful because its have all the seven colour.", "Osindak ong buluntung tu nopompon turu o warana."], ["When we caught in the rain, we usually get sick.", "Kasakit mang odorunan."], ["December is the rainy season.", "Bulan Duabalas manampangi no."], ["Year ends usually a rainy season.", "Magadarun mahi ong pongovian dot toun."], ["Stand up, lets us go.", "Ingkazut no, mamanau tokou no."], ["Fetch the rake, so I can sweep up the rubbish under the house.", "Onuvo i surud, ponurud ku diti somumut sid sunsud."], ["Don't forget to comb your hear in the morning.", "Kadan polingan monurud dinot obuk ong sasarap."], ["She was raped by him.", "Binaag-baag dialo it ondu diri."], ["Extra carefull when you on the road, there is a bad people that will rape.", "Atagon no sid ralan, mamaag-baang mang ulun do neduan tuo."], ["Until when is your holiday?", "Sampai sera o suti nu?"], ["Did you arrive at Sandakan?", "Nokorikot ko noka sid Sandakan dino?"], ["Sit on the floor if you want to eat.", "Sondot mogom-ogom ong makan ko."], ["Have a safe journey on your way home.", "Umbasi-basi mamanau ong muli ko no biano."], ["You don't tell me that you mana pee untill you urinated at your pants.", "Minomoros ko nga amu do tisobu ko sampai nokosobu ko sinod suval nu."], ["Let's eat, I have a manggo salad.", "Makan tokou, varo dinonsul ku do mampalam."], ["No more salt to make the savoury dish.", "Navi ot asin, ino pogi amu no osin ino taduk dino."], ["I wanna watch them slaughter the buffalo.", "Mimot oku po dioti mangagaraas dilo karabau."], ["You baby name is sound alike my name.", "Kasangai ngaran ku ong ino ngaran dot anak nu."], ["I can't recognise well each of you.", "Miluu kou songobpinai mai. Mad, amu osodirizan ku ikou.Your siblings look identical."], ["There is no one beauty like Mundari in the kampong.", "Aso kerad kovosiho di Mundari sitid kampung diti."], ["Stand beside Anak, Who is taller between you two?", "Rompok po di Anak, Isai naru dikou duvo?"], ["Your children is alike you.", "Luu nu ilot vuros dot anak nu hodi."], ["A pillow without a pillowcase feels dirty to her.", "Asakahan yalo, ong aso sarung i bantal dau."], ["I disgusted eating fish.", "Abangat oku mangakan sada."], ["Eat untiil you satisfied, don't be shy.", "Pising vizau no makan, kada kekum-ikum."], ["I would like to take your puppy if you willing to give it to me.", "Onuvon ku ino duku dikou ong kozuan dikou patahak."], ["If you are poor, don't take a second wife, or the children will starve.", "Kadan magapid ong mosikim, lumikop dati anak dot ulun."], ["I would like to imatate her in making a breads.", "Mamit oku dialo monuluw tinggol."], ["Drunken person cannot be controled.", "Amu ma opusus ong moginuhod o magavuk oi."], ["Next week I will take my day off, will going back to my village.", "Sumuti oku ong minggu rumikot, muli opku sid kampung."], ["Please take off this stone on my feet.", "Lungkabo po dikou dohon iti vatu, nodsitan iti hakod ku."], ["I will bring umbrella, maybe it will raining soon.", "Mongovit oku po do pazung tu dumarun dati."], ["Your future father-in-law is my uncle.", "Amazon ku ilo ama dilo sovoon nu dilo."], ["She fainted at the road because of the hot weather.", "Novunusan yalo sid tanga ralan tu kalasu dot addau."], ["How to make a pickled star-fruit?", "Kuran gama mongodonsul diti pizas"], ["Do you understand Chiness language?", "Karahati ko noka mongining boros do Kina?"], ["Do understand what you are talking about.", "Ohorotizan-i dau nunu ino boroson nu dino."], ["What do you talking about?", "Nunu ka harati dino boroson nu dino?"], ["Why is the person naked?", "Nokuro inot ulun dino tu maba-labas?"], ["These troubles will be harder for you than what your ancestors experienced.", "Iti kosusaan diti lobi po kopogos mantadko i nabambaran dit angaaki nu."], ["The valley is good to be plant with banana.", "Avantang tanaman do punti ino napu dino."], ["Read a verse from the bible. I would love to hear it.", "Pamasa po ka ayat antad sid Kitab, tining oku."], ["Cannot fight against parents when they are giving you an advise.", "Amu kavasa sumaap ong molohing o moniag."], ["I can't climb Mt Kinabalu, I feel dizzy when I'm is very high up.", "Amu kendakod oku Nabalu ong yoku diti tu biruvokon oku ong asavat no mahi."], ["I feel dizzy when I look down from the top of a building.", "Biruvokon oku ong tumuddung no antad sid savat do bangunan."], ["I would really like to go with you when you return to America", "Banalko engin oku mozo dikau muli sid Morikan."], ["I am very happy because you take time to come and visit me.", "Ohigak oku tu nokotibang ko rumikot magandaha dohon."], ["This blanket is have urinate smell because Kondong piss on it last night.", "Apasong ogi iti timog tu nosobuvan di Kondong kosodop."], ["You smell like urine, did you piss on your short?", "Apasong ko, nokosobu ko naku sid suval nu?"], ["I threw a ball of paper at him.", "Pinilai ku yalo do binulugu do karatas."], ["You doing homework so slowly.", "Oboloti banal mang ikau minggama-gama oi."], ["Wait the way there, she maybe walk over there.", "Avang sino, dati ong mitalib yalo."], ["We went to Kudat today.", "Minamanau okoi sid Kudat biano."], ["Let us go to Kudat tomorrow.", "Mamanau kito sid Kudat do suvab."], ["Let me just go along the verandah of the long house.", "Minduzuw oku po diti tingkang do binatang."], ["We are walking around the yard when they are arrive.", "Manau-panau okoi sid natad hiza nokorikot yoti."], ["Where did your Papang went, its already noon but he hasn't come back yet?", "Siombo pinanau di Papang dikou diri tu sumodop no nga amu po nokouli?"], ["I like you a lot.", "Ingin oku dika."], ["I'll warm myself by the fire. I've been caught in the rain.", "Magamut oku po sid apui, notogipan oku do darun."], ["Warm yourself by the fire, if you feel cold.", "Magamut silod apui ong sogiton ko no."], ["I would like to warming up myself beside the wooden kitchen because I feel cold.", "Dumadang oku po silod ropuhan oi, sogiton oku."], ["Warm yourself at trhekitchen if you are cold.", "Dadang sid ropuhan ong sogiton ko no."], ["Your threads are colourfull.", "Osindak ong iti gontizan nu."], ["Next year I will build a very large house.", "Toun vagu, muvalai oku do banalko agazo o valai."], ["Did you see my yellow shirt?", "I banat dot osilou ku, nemot dikou oi?"], ["Its a snake type with yellow color.", "Mansak-punti dino gingis do vulanut nga osilou o votik dot inan dau."], ["I admit that I took the money.", "Mongoho oku do yoku minanganu di siin nu."], ["Say yes, with my question if you do love me?", "Oho po ilo duatan ku dikau ong banal noko ozi ko dohon?"], ["Because you a brave, you slaughter the chicken.", "Ikau tu osiou, hodi garaso ilo manuk."], ["You are still young, do not married early.", "Omulok ko po dino, kada po pokisavo."], ["The young men of Montuson are all very strong!", "Anakvagu do Montuson ongokakansang!"], ["We as the young generation should honour those who are older.", "I tokou solumpak vagu, apatut do mongohorumat di momodlohing no."], ["Is this yours hat, mister?", "Dikau naku iti sirung diti, kuvoon?"], ["Is this your shirt?", "Dika ka do banat iti?"], ["We as the young generation should honour those who are older.", "I tokou solumpak vagu, apatut do mongohorumat di momodlohing no."]]
