[["Many macaque at the swamp.", "Ogumu gobuk sid katangaran."], ["I would like to eat a grilled corn at the farm.", "Tiakan oku linugu dalai sid tagad ong iti."], ["Plant some pumpkin at your small field.", "Tanamai labuk ino gopu nu."], ["I'll first do my work, then I'll sleep.", "Mangagama oku po di karaja ku, om modop oku ogi."], ["Human beings only get to eat if they work hard.", "Suvaiko aparu gumama om kakan ogi ong riniba."], ["Work hard at it, this isn't just for fun!", "Gumama no banal, okonko bai humangi."], ["Your nail is so long and its black.", "Rinaru sondulu nu diti, etom po kagi."], ["Who is your name?", "Isai ngaran nu?"], [" I named you, Mosong.", "Pungaranan ku ikau dot i Mosong."], ["He have a nasal sounding of voice.", "Dongot ong yalo bala dino."], ["Sikob's son is naughty. He stole.", "Obungou ko ulun ong anak di Sikob, manakau."], ["I am going near, don't you wanna follow me?", "Osomok oku diti, a-ka mozo ko dohon?"], ["Sit near me if you want me to feed you.", "Siti kod somok ku ong mokisuvu kono."], ["I sit near by grandma at verandah.", "Tiumoning oku di odu mogom sid tingkang."], ["The key is under the table.", "Sid siba do mija i kunsi."], ["Without a paddle, how can we row home?", "Ong aso gagau, kuran tokou mingalud muli?"], ["The flour is made from wheat.", "Ino tapung dino gandum o ginama."], ["Onoi's husband is someone who obedient.", "Obozigi mang ilo savo di Onoi oi."], ["Listen and obey when someone give you an advise.", "Mangasip no ong barasan."], ["Yoboi get catch an octopus in the stone hole when we are at the sea.", "Nakanu Yoboi do poliputan sid luvang do vatu i sid rahat okoi."], ["Today is the date where i actually meet my doctor.", "Biano bala i jumumpa oku do dokutul diri."], ["Of course he only wants to make people laugh.", "Andang ko bai ponugirak ong yalo dino dot ulun."], ["Maslina's husband is short and stocky person.", "Ahadtong koulun mang ilo savo di Maslina dino."], ["You have a bass sound when you are singing.", "Obohog ino dolou nu ong mindolongoi ko no."], ["Take what Onong gave to you.", "Romito ilo itunui di Onong si dikau."], ["Oh dear! I forget to bring my purse, Inai said.", "Aiyah! Nolingan ku mongovit i pongizanan ku siiin, ka di Inai."], ["All right, if that the case then I do agree.", "Ba, ong yad dino, mangakun oku-i."], ["Do you know how to row?", "Elo ko noka gumau dino?"], ["The women start planting hill rice, as soon as the planting constellation is in the the zenith.", "It ongoondu mamangasok no ong sumakai no i pangasakan."], ["Galong car is red in colour.", "Aragang o sahat kurita di Galong."], ["Where is the other pair of your slippers?", "Siombi antom diti soripal nu?"], ["Cook the edible palm heart with the chicken wings.", "Toduko ilo tivak do nizuw, avahai dilot alad do manuk."], ["I would like to eat one.", "Mangagama oku po do tinopis, tiakan oku.I will cook pancake."], ["The cause of his death is his pancreass unfunctional.", "I kinapatazan dialo diri, napasa it arip dau ka."], ["You always scold your child.", "Sumul mogoduw dot anak ong ikau."], ["I asking you, who is your name?", "Mongoduat oku dikou, isai ngaran nu?"], ["Ask the teacher if you have something that you don't know.", "Duat silod sigu hodi ong varo not amu elaan nu."], ["Give me a rug to wipe the spilled water.", "I gansing positio dikou, pangalap ku dinot vaig do nuza."], ["The rain is heavy this afternoon until the river is overflow.", "Asapou darun di minsosodop sampai nakalampai i bavang."], ["Ranibow is beautiful because its have all the seven colour.", "Osindak ong buluntung tu nopompon turu o warana."], ["When we caught in the rain, we usually get sick.", "Kasakit mang odorunan."], ["December is the rainy season.", "Bulan Duabalas manampangi no."], ["Year ends usually a rainy season.", "Magadarun mahi ong pongovian dot toun."], ["Stand up, lets us go.", "Ingkazut no, mamanau tokou no."], ["Fetch the rake, so I can sweep up the rubbish under the house.", "Onuvo i surud, ponurud ku diti somumut sid sunsud."], ["Don't forget to comb your hear in the morning.", "Kadan polingan monurud dinot obuk ong sasarap."], ["She was raped by him.", "Binaag-baag dialo it ondu diri."], ["Extra carefull when you on the road, there is a bad people that will rape.", "Atagon no sid ralan, mamaag-baang mang ulun do neduan tuo."], ["Until when is your holiday?", "Sampai sera o suti nu?"], ["Did you arrive at Sandakan?", "Nokorikot ko noka sid Sandakan dino?"], ["Sit on the floor if you want to eat.", "Sondot mogom-ogom ong makan ko."]]
