[["Walk at the front if you holding a torch.", "id gulu mamanau ong kikinavid do sotirip."], ["Use your ears to hear.", "Ponginingon ino pinalung."], ["I finished planting all my land with coconut trees.", "Notongkop ku no mananom do nizuw i tana ku."], ["Housework has become easy now that we have piped water in the house.", "Adavasi no minggama-gama ong biano no tu kipaip no sid valai."],["The sun is nearly set.", "Oruhai nom tumonob ilot mato dot addau."], ["Its easy to make that fish trap if you know how to do it.", "Oruhai mangagama dino bubu dino ong elo ogi."], ["Do you eat sauerkraut?", "Mangakan ko ka do sinamu?"], ["Sit, all of you, lets eat!", "Ogom kou, mongogulon tokou."], ["Eat, I'm sure you are hungry.", "Akan no, vitilon ko dino."], ["Eat until you satisfy your hunger.", "Vizahon no bo ong makan."], ["Kodili is gobbling up his food, he must be hungry!", "Mamabut no i Kodili makan, vitilon banal naku yosido."], ["I want to make buisness, where is your toilet?", "Tuami oku po, siombo tandas dikou?"], ["I am drunk. They gave me drink rice wine at the neighbourhood.", "Avuk oku diti. Nenum oku dioti do lihing sid sombol."], ["She fainted at the road because of the hot weather.", "Novunusan yalo sid tanga ralan tu kalasu dot addau."], ["Faith that you belief will make you live.", "I kosipan dot abanal o kapasi penlaid."], ["This old house is falling apart because it's stilts are rotten.", "Humuzas no iti pogun do valai diti tu ongorobuk no itit origi dau."], ["Gather the battlenut fruit that fallen from the tree.", "Puruto ilo loho dot inggaton."], ["Galangal is spicy as a ginger.", "Opodos ong longuas yadko lazo."], ["Let us go to the church this Sunday.", "Sumambayang tokou po ong minggu."], ["What gender is your new baby born?", "Nunu no soluvon dit anak nu di kosino?"], [" would like to take your puppy if you willing to give it to me.", "Onuvon ku ino duku dikou ong kozuan dikou patahak.I"], ["Its norm to old people.", "Dadan do lumohing no, amu tantu korongou ong pibabarasan."], ["Please take the hammer. I want to knock the nail.", "Onuvo dikou i dunsul. Pongodunsul ku dilo paku do nokotulai."], ["Knock the nail harder so that the nail will go deep faster.", "Lagad-lagadan mongodunsul ino paku dino nga katisop koduruk."], ["My wrist is hurt, why is it?", "Oruol iti lunggazan ku diti, nokokuro ma?"], ["This sweater is woven by my grandmother.", "Inavol dit oduon ku iti banat ku diti."], ["Let's do some hand wrestling, to see which of us is the strongest.", "Mibilad kito kai, isai dikito do banalko ahakang."], ["Hang on with the guava branches.", "Ginit no sinod raan do koliabas."], ["What happened to him on the way?", "Nunu o nabambaran dau sid tanga do vazaan?"]]
