[["I threw a ball of paper at him.", "Pinilai ku yalo do binulugu do karatas."], ["You doing homework so slowly.", "Oboloti banal mang ikau minggama-gama oi."], ["Wait the way there, she maybe walk over there.", "Avang sino, dati ong mitalib yalo."], ["We went to Kudat today.", "Minamanau okoi sid Kudat biano."], ["Let us go to Kudat tomorrow.", "Mamanau kito sid Kudat do suvab."], ["Let me just go along the verandah of the long house.", "Minduzuw oku po diti tingkang do binatang."], ["We are walking around the yard when they are arrive.", "Manau-panau okoi sid natad hiza nokorikot yoti."], ["Where did your Papang went, its already noon but he hasn't come back yet?", "Siombo pinanau di Papang dikou diri tu sumodop no nga amu po nokouli?"], ["I like you a lot.", "Ingin oku dika."], ["I'll warm myself by the fire. I've been caught in the rain.", "Magamut oku po sid apui, notogipan oku do darun."], ["Warm yourself by the fire, if you feel cold.", "Magamut silod apui ong sogiton ko no."], ["I would like to warming up myself beside the wooden kitchen because I feel cold.", "Dumadang oku po silod ropuhan oi, sogiton oku."], ["Warm yourself at trhekitchen if you are cold.", "Dadang sid ropuhan ong sogiton ko no."], ["Your threads are colourfull.", "Osindak ong iti gontizan nu."], ["Next year I will build a very large house.", "Toun vagu, muvalai oku do banalko agazo o valai."], ["Did you see my yellow shirt?", "I banat dot osilou ku, nemot dikou oi?"], ["Its a snake type with yellow color.", "Mansak-punti dino gingis do vulanut nga osilou o votik dot inan dau."], ["I admit that I took the money.", "Mongoho oku do yoku minanganu di siin nu."], ["Say yes, with my question if you do love me?", "Oho po ilo duatan ku dikau ong banal noko ozi ko dohon?"], ["Because you a brave, you slaughter the chicken.", "Ikau tu osiou, hodi garaso ilo manuk."], ["You are still young, do not married early.", "Omulok ko po dino, kada po pokisavo."], ["The young men of Montuson are all very strong!", "Anakvagu do Montuson ongokakansang!"], ["We as the young generation should honour those who are older.", "I tokou solumpak vagu, apatut do mongohorumat di momodlohing no."], ["Is this yours hat, mister?", "Dikau naku iti sirung diti, kuvoon?"], ["Is this your shirt?", "Dika ka do banat iti?"], ["We as the young generation should honour those who are older.", "I tokou solumpak vagu, apatut do mongohorumat di momodlohing no."]]
