[["Have a safe journey on your way home.", "Umbasi-basi mamanau ong muli ko no biano."], ["You don't tell me that you mana pee untill you urinated at your pants.", "Minomoros ko nga amu do tisobu ko sampai nokosobu ko sinod suval nu."], ["Let's eat, I have a manggo salad.", "Makan tokou, varo dinonsul ku do mampalam."], ["No more salt to make the savoury dish.", "Navi ot asin, ino pogi amu no osin ino taduk dino."], ["I wanna watch them slaughter the buffalo.", "Mimot oku po dioti mangagaraas dilo karabau."], ["You baby name is sound alike my name.", "Kasangai ngaran ku ong ino ngaran dot anak nu."], ["I can't recognise well each of you.", "Miluu kou songobpinai mai. Mad, amu osodirizan ku ikou.Your siblings look identical."], ["There is no one beauty like Mundari in the kampong.", "Aso kerad kovosiho di Mundari sitid kampung diti."], ["Stand beside Anak, Who is taller between you two?", "Rompok po di Anak, Isai naru dikou duvo?"], ["Your children is alike you.", "Luu nu ilot vuros dot anak nu hodi."], ["A pillow without a pillowcase feels dirty to her.", "Asakahan yalo, ong aso sarung i bantal dau."], ["I disgusted eating fish.", "Abangat oku mangakan sada."], ["Eat untiil you satisfied, don't be shy.", "Pising vizau no makan, kada kekum-ikum."], ["I would like to take your puppy if you willing to give it to me.", "Onuvon ku ino duku dikou ong kozuan dikou patahak."], ["If you are poor, don't take a second wife, or the children will starve.", "Kadan magapid ong mosikim, lumikop dati anak dot ulun."], ["I would like to imatate her in making a breads.", "Mamit oku dialo monuluw tinggol."], ["Drunken person cannot be controled.", "Amu ma opusus ong moginuhod o magavuk oi."], ["Next week I will take my day off, will going back to my village.", "Sumuti oku ong minggu rumikot, muli opku sid kampung."], ["Please take off this stone on my feet.", "Lungkabo po dikou dohon iti vatu, nodsitan iti hakod ku."], ["I will bring umbrella, maybe it will raining soon.", "Mongovit oku po do pazung tu dumarun dati."], ["Your future father-in-law is my uncle.", "Amazon ku ilo ama dilo sovoon nu dilo."], ["She fainted at the road because of the hot weather.", "Novunusan yalo sid tanga ralan tu kalasu dot addau."], ["How to make a pickled star-fruit?", "Kuran gama mongodonsul diti pizas"], ["Do you understand Chiness language?", "Karahati ko noka mongining boros do Kina?"], ["Do understand what you are talking about.", "Ohorotizan-i dau nunu ino boroson nu dino."], ["What do you talking about?", "Nunu ka harati dino boroson nu dino?"], ["Why is the person naked?", "Nokuro inot ulun dino tu maba-labas?"], ["These troubles will be harder for you than what your ancestors experienced.", "Iti kosusaan diti lobi po kopogos mantadko i nabambaran dit angaaki nu."], ["The valley is good to be plant with banana.", "Avantang tanaman do punti ino napu dino."], ["Read a verse from the bible. I would love to hear it.", "Pamasa po ka ayat antad sid Kitab, tining oku."], ["Cannot fight against parents when they are giving you an advise.", "Amu kavasa sumaap ong molohing o moniag."], ["I can't climb Mt Kinabalu, I feel dizzy when I'm is very high up.", "Amu kendakod oku Nabalu ong yoku diti tu biruvokon oku ong asavat no mahi."], ["I feel dizzy when I look down from the top of a building.", "Biruvokon oku ong tumuddung no antad sid savat do bangunan."], ["I would really like to go with you when you return to America", "Banalko engin oku mozo dikau muli sid Morikan."], ["I am very happy because you take time to come and visit me.", "Ohigak oku tu nokotibang ko rumikot magandaha dohon."], ["This blanket is have urinate smell because Kondong piss on it last night.", "Apasong ogi iti timog tu nosobuvan di Kondong kosodop."], ["You smell like urine, did you piss on your short?", "Apasong ko, nokosobu ko naku sid suval nu?"]]
