[["I am a poor person.", "Yoku diti ulun do mosikim."], ["As for me, I am a son of Bagu, said Bandis.", "Yoku nobo diti, anak di Bagu, ka di Bandis."], ["I will cook for myself if I am hungry.", "Yoku kondiri o magazau ong vitilon oku no."], ["Put the fish inside the refrigerator or it will rotten.", "Posuvango inot sada silod aisbuk tu masa dati."], ["Your siblings look identical. I can't recognise well each of you.", "Miluu kou songobpinai mai. Mad, amu osodirizan ku ikou."], ["That's why I don't eat chilli, because if I do, I get bad heart-burn.", "Sabap pogi om amu mangakan oku do lada, husukon oku ong koponosok oku no."], ["Go meet with YB, maybe he will give you money.", "Samung kou di YB, kaluto ong manahak yalo do siin."], ["He is ignorant, because he has been to the city only once so far.", "Sakai ong yalo tu insan ogi kosirid bandal."], ["What are you sick with that you can't walk?", "Nunu ka sakit nu tu amu ko kapanau?"], ["I imagining that I am rich.", "Monorou oku po do lumundu oku."], ["I imagine that you miss me.", "Osorou ku do langadon ko dohon."], ["Imagine me if you miss me.", "Soroho oku no ong langadon ko dohon."], ["I would like to imatate her in making a breads.", "Mamit oku dialo monuluw tinggol."], ["Sikob's son is naughty. He stole.", "Obungou ko ulun ong anak di Sikob, manakau."], ["We call a woman immoral, if she always runs around with men she is not married to.", "Akahag o pongoretan ong ondu do songkovozoo do kusai dot okonko savo dau."], ["Just stay in your room if you don't want to go.", "Obong sinod ongkob ong malan ko no mamanau."], ["If in case we went to Kudat, leave me the money for the electric bill payment.", "Kalu ong kosunu okoi Kumudat, opungai oku laid do siin pamayal ku dino karan tokou."], ["Go meet with YB, mmaybe he will give you money.", "Samung kou di YB, kaluto ong manahak yalo do siin."], ["Its danger cycling oin the road!", "Kopunovot mahi mimbasikal sid alun-alun!"], ["I am in difficulty this time because my children is sick.", "Osusaan oku ginavo didino diti tu sumakit it anak ku."], ["Today is the date where i actually meet my doctor.", "Biano bala i jumumpa oku do dokutul diri."], ["People who do wrong, will go to jail.", "Isai nasala, kosuvang sid torungku."], ["Adi has no work, he sleeps the whole time.", "Aso gagamaon di Adi, bai modop nopo."], ["Don't join them playing if they cry easily.", "Kadan no mamung mimomoi ong obogihad ko ulun."], ["Join us because we are just a few.", "Amung siti dahai tu okudik ong yokoi."], ["I fell so happy because father are healed.", "Higak sid ginavoku tu nolingasan no Yama do sakit."], ["Look, the monkey jumping to the tree.", "Hodi, modtopik ilo kara silod kazu."], ["Modtopik yara silod kazu.", "The monkey jumping at the tree."], ["Jump to this guava branchess.", "Topik sitid raan do koliabas."], ["I was left alone in the boat, he was in the water. So I thought, If my husband doesn't manage to get back up into the boat, I'd better jump into the water, too! I said.", "Iseso oku po sid alud, yosido sid saralom do vaig. Na ka di ginavo ku, “Ong aso no koindakadan di kuvoon dino, osuhul ong tumuhop oku diti,” ka di ginavo ku."], ["He is jumping up and down while crying.", "Magandak no yalo mogihad."], ["Hop, don't just stand there.", "Andak, kadan bai pengkakat sino."], ["Jump in if you want to take a bath.", "Tuhop no siti ong modsu ko no."], ["Look at the monkey jumping from branch to branch.", "Imatai dikou ilo kara modturopik."], ["This jungle fruit is sour.", "Onsom ong iti bambangan."], ["The kids are so happy running at the yard.", "Ohigak ogi ilot angaanak santangkus silod natad."], ["I wanna watch them slaughter the buffalo.", "Mimot oku po dioti mangagaraas dilo karabau."], ["What kind was that plant that is good for the stomach as a medicine?", "Nunu ka gingis di kazu do koubat do tizan diri?"], ["I'm craving for this special rice at the moment.", "Tiakan oku lumansat ong iti."], ["Your wedding goun is full of lace.", "Ogumu banal do rinda ino banat nu mogontong."], ["Carefull at the stairs because its maybe slipery.", "Atagon no sinod tukad tu alamou mahi ino."], ["Sit on the floor if you want to eat.", "Sondot mogom-ogom ong makan ko."], ["The plane is landing.", "Sumondot no ilo tarabang."], ["The road to Ranau was washed away because of heavy rain.", "Nozuzu it alun-alun kumaa sid Ranau tu kologod do darun."], ["Welson's house was hit by a landslide.", "Nantakan do zuzu i valai di Welson."], ["Today is the last day we harvesting paddy, as only small areas leaf not been harvested yesterday.", "Kovian no mongomot biano tu opodok no it omoton nobi mongomot konihab."], ["For now we better cope with eating chilli, because we have grilled sting ray for the side-dish.", "Sumakap po mangakan do lada ong biano tu tinunuvan pahi ot ikana."], ["You shit too long.", "Alaid banal tumai ong ikau."], ["Wake up! Or you would late to school.", "Posik no! Eduan ko di sumikul ko."]]
