[["Who's money is on the table?", "Disai do siin iti sid mija diti?"], ["Please pour some water in this bamboo container, I want to drink.", "Ihibai poka do vaig iti sangit, inumon ku."], ["The sun is swallowed by the Tarob.", "Tinolon do tarob ilot addau."], ["I just finish a cup of coffee.", "Sansangkil o kupi navi ku monginum dino no."], ["Orong mouth is full with cookies.", "Nababol do kinulat ilo munung di Orong."], ["Let your child sleep at the swing.", "Podopo sid dazung inot anak nu."],
["I don't have the strength to climb Mt. Kinabalu.", "Omu oku kogoos tumakad do Nabalu."], ["The dog has many puppies.", "Ogumu anak dilot asu."], ["My baby finger is hurt because a crab pinch it.", "Oruol iti angkakis ku, noongipan do kabou."], ["Idot's househelp is from Indonesia.", "I kinambo di Idot, ulun antad sori ponong Indon."], ["The young men of Montuson are all very strong!", "Anakvagu do Montuson ongokakansang!"], ["Put the book inside your bag.", "Posuvango ino buuk sid juli nu."], ["Worm as lure is the best for rod-fishing.", "Lingguvang bo buzazat magapon dot odukon."], ["He is bald.", "Aso obuk di aki nu, butul.Your grandfather dosen't have hair."], ["Grandpa is bald, he shave his head.", "Gundul no i aki, sinukul dau it ulu dau."], ["I threw a ball of paper at him.", "Pinilai ku yalo do binulugu do karatas."], ["We can't play football, our ball deflated.", "Nakampis iti bula di tokou, amu tokou no kopimomoi diti."], ["We go and cut down bamboo tree on the afternoon.", "Managad kito do vulu ong minsosodop."], ["I forgot to plant my shoot of the padang banana.", "Nolingan ku mananom i sakat ku do padang."], ["The api-api is not ripe yet.", "Amu po mansak ilo api-api."], ["The baba banana is ripe, it is very aromatic.", "Mansak no ilo baba, ovongi ogi."], ["Do you want to eat banana?", "Mangakan ko ka do torosok?"], ["Put the bird inside the cage.", "Posuvango sid tongkurung inot ombolog."], ["The buffalo's baby was escaped.", "Nakalabus it uzog do karabau."], ["My calf biten by a dog.", "Nokokot dot asu iti votis ku."], ["The new nurse at that clinic call me as sister.", "Ilo naas vagu silod kolinik dilo manangaka dohon."], ["Norika's step childrens now knows to call him as a dad.", "Karaharti noma manangama di Norika ilot angaanak do nosingkapu dau."], ["Can you reach the basket?", "Orikot nu-i ka monivol ilo raga dilo?"], ["Can you see at the back?", "Kemot ko-i ka sinod tohudi?"], ["There is an abnormal growth on my arm.", "Varo nanakan sid longon ku."], ["There is a cannon during war at the museum.", "Varo bajil do hiza mononjipun po ong sid mozium."], ["My father dosen't health enough.", "Amu ali-ali it ama ku."], ["Dagger is sharp.", "Atarom ong baladou."], ["It's cold to wear this shirt, because it is damp.", "Osogit banaton iti banat tu adamil."], ["Dance with your husband!", "Andak dilo savo nu sumundai."], ["Do you dare swim across the river?", "Kobulun ko ka mintozog mitupak dot olungan?"], ["It's getting dark and they still haven't returned from the fields. Why ever not?", "Mimbabarou no, nga aso koulian dioti antad sid tagad. Nokuro ma?"], ["The cloud is dark, it will be raining.", "Dumarun dati iti tu akapal ino mituvong."], ["What is the date today?", "Nunu aribulan addau biano?"], ["This is only the second day after what's-is-name's death.", "Addau koduvo ogi kinapatazan di kuvo biano."], ["How many days is your boss paying you for to harvest?", "Piro ot inaddahan ka do mangagaji i bos mongomot?"], ["The chick is dead. What happened?", "Minatai ilo pizak. Nokuro ino?"], ["Are you deaf? You not listening when be calling.", "Bongung ko ka tu amu korongou ko kodimon."], ["You argue so much when people advised you.", "Ogumu ma dahava ong ikau o barasan to."], ["Let's put this rotten wood on the wood burning pile.", "Ino robuk do kazu ot isudu ong muapui no."], ["Dont refuse to take it if given money. Just take it!", "Kadan no mangamu ong tahankan do siin, onuvon-i."]]
