[["Many macaque at the swamp.", "Ogumu gobuk sid katangaran."], ["I would like to eat a grilled corn at the farm.", "Tiakan oku linugu dalai sid tagad ong iti."], ["Plant some pumpkin at your small field.", "Tanamai labuk ino gopu nu."], ["I'll first do my work, then I'll sleep.", "Mangagama oku po di karaja ku, om modop oku ogi."], ["Human beings only get to eat if they work hard.", "Suvaiko aparu gumama om kakan ogi ong riniba."], ["Work hard at it, this isn't just for fun!", "Gumama no banal, okonko bai humangi."], ["Your nail is so long and its black.", "Rinaru sondulu nu diti, etom po kagi."], ["Who is your name?", "Isai ngaran nu?"], [" I named you, Mosong.", "Pungaranan ku ikau dot i Mosong."], ["He have a nasal sounding of voice.", "Dongot ong yalo bala dino."], ["Sikob's son is naughty. He stole.", "Obungou ko ulun ong anak di Sikob, manakau."], ["I am going near, don't you wanna follow me?", "Osomok oku diti, a-ka mozo ko dohon?"], ["Sit near me if you want me to feed you.", "Siti kod somok ku ong mokisuvu kono."], ["I sit near by grandma at verandah.", "Tiumoning oku di odu mogom sid tingkang."], ["The key is under the table.", "Sid siba do mija i kunsi."], ["Without a paddle, how can we row home?", "Ong aso gagau, kuran tokou mingalud muli?"], ["The flour is made from wheat.", "Ino tapung dino gandum o ginama."], ["Onoi's husband is someone who obedient.", "Obozigi mang ilo savo di Onoi oi."], ["Listen and obey when someone give you an advise.", "Mangasip no ong barasan."], ["Yoboi get catch an octopus in the stone hole when we are at the sea.", "Nakanu Yoboi do poliputan sid luvang do vatu i sid rahat okoi."], ["Today is the date where i actually meet my doctor.", "Biano bala i jumumpa oku do dokutul diri."], ["Of course he only wants to make people laugh.", "Andang ko bai ponugirak ong yalo dino dot ulun."], ["Maslina's husband is short and stocky person.", "Ahadtong koulun mang ilo savo di Maslina dino."], ["You have a bass sound when you are singing.", "Obohog ino dolou nu ong mindolongoi ko no."], ["Take what Onong gave to you.", "Romito ilo itunui di Onong si dikau."], ["Oh dear! I forget to bring my purse, Inai said.", "Aiyah! Nolingan ku mongovit i pongizanan ku siiin, ka di Inai."], ["All right, if that the case then I do agree.", "Ba, ong yad dino, mangakun oku-i."], ["Do you know how to row?", "Elo ko noka gumau dino?"], ["The women start planting hill rice, as soon as the planting constellation is in the the zenith.", "It ongoondu mamangasok no ong sumakai no i pangasakan."], ["Galong car is red in colour.", "Aragang o sahat kurita di Galong."], ["Where is the other pair of your slippers?", "Siombi antom diti soripal nu?"], ["Cook the edible palm heart with the chicken wings.", "Toduko ilo tivak do nizuw, avahai dilot alad do manuk."], ["I would like to eat one.", "Mangagama oku po do tinopis, tiakan oku.I will cook pancake."], ["The cause of his death is his pancreass unfunctional.", "I kinapatazan dialo diri, napasa it arip dau ka."], ["You always scold your child.", "Sumul mogoduw dot anak ong ikau."], ["I asking you, who is your name?", "Mongoduat oku dikou, isai ngaran nu?"], ["Ask the teacher if you have something that you don't know.", "Duat silod sigu hodi ong varo not amu elaan nu."], ["Give me a rug to wipe the spilled water.", "I gansing positio dikou, pangalap ku dinot vaig do nuza."], ["The rain is heavy this afternoon until the river is overflow.", "Asapou darun di minsosodop sampai nakalampai i bavang."], ["Ranibow is beautiful because its have all the seven colour.", "Osindak ong buluntung tu nopompon turu o warana."], ["When we caught in the rain, we usually get sick.", "Kasakit mang odorunan."], ["December is the rainy season.", "Bulan Duabalas manampangi no."], ["Year ends usually a rainy season.", "Magadarun mahi ong pongovian dot toun."], ["Stand up, lets us go.", "Ingkazut no, mamanau tokou no."], ["Fetch the rake, so I can sweep up the rubbish under the house.", "Onuvo i surud, ponurud ku diti somumut sid sunsud."], ["Don't forget to comb your hear in the morning.", "Kadan polingan monurud dinot obuk ong sasarap."], ["She was raped by him.", "Binaag-baag dialo it ondu diri."], ["Extra carefull when you on the road, there is a bad people that will rape.", "Atagon no sid ralan, mamaag-baang mang ulun do neduan tuo."], ["Until when is your holiday?", "Sampai sera o suti nu?"], ["Did you arrive at Sandakan?", "Nokorikot ko noka sid Sandakan dino?"], ["Sit on the floor if you want to eat.", "Sondot mogom-ogom ong makan ko."], ["I threw a ball of paper at him.", "Pinilai ku yalo do binulugu do karatas."], ["You doing homework so slowly.", "Oboloti banal mang ikau minggama-gama oi."], ["Wait the way there, she maybe walk over there.", "Avang sino, dati ong mitalib yalo."], ["We went to Kudat today.", "Minamanau okoi sid Kudat biano."], ["Let us go to Kudat tomorrow.", "Mamanau kito sid Kudat do suvab."], ["Let me just go along the verandah of the long house.", "Minduzuw oku po diti tingkang do binatang."], ["We are walking around the yard when they are arrive.", "Manau-panau okoi sid natad hiza nokorikot yoti."], ["Where did your Papang went, its already noon but he hasn't come back yet?", "Siombo pinanau di Papang dikou diri tu sumodop no nga amu po nokouli?"], ["I like you a lot.", "Ingin oku dika."], ["I'll warm myself by the fire. I've been caught in the rain.", "Magamut oku po sid apui, notogipan oku do darun."], ["Warm yourself by the fire, if you feel cold.", "Magamut silod apui ong sogiton ko no."], ["I would like to warming up myself beside the wooden kitchen because I feel cold.", "Dumadang oku po silod ropuhan oi, sogiton oku."], ["Warm yourself at trhekitchen if you are cold.", "Dadang sid ropuhan ong sogiton ko no."], ["Your threads are colourfull.", "Osindak ong iti gontizan nu."], ["Next year I will build a very large house.", "Toun vagu, muvalai oku do banalko agazo o valai."], ["Did you see my yellow shirt?", "I banat dot osilou ku, nemot dikou oi?"], ["Its a snake type with yellow color.", "Mansak-punti dino gingis do vulanut nga osilou o votik dot inan dau."], ["I admit that I took the money.", "Mongoho oku do yoku minanganu di siin nu."], ["Say yes, with my question if you do love me?", "Oho po ilo duatan ku dikau ong banal noko ozi ko dohon?"], ["Because you a brave, you slaughter the chicken.", "Ikau tu osiou, hodi garaso ilo manuk."], ["You are still young, do not married early.", "Omulok ko po dino, kada po pokisavo."], ["The young men of Montuson are all very strong!", "Anakvagu do Montuson ongokakansang!"], ["We as the young generation should honour those who are older.", "I tokou solumpak vagu, apatut do mongohorumat di momodlohing no."], ["Is this yours hat, mister?", "Dikau naku iti sirung diti, kuvoon?"], ["Is this your shirt?", "Dika ka do banat iti?"], ["We as the young generation should honour those who are older.", "I tokou solumpak vagu, apatut do mongohorumat di momodlohing no."], ["Jesus foretold that just before the Kingdom brings peace to the earth, our world would be plagued with wars, famines, and earthquakes", "Nokentahan no laid di Yesus dot varo miparang, vitil om momodguzu i pomogunan sobolum po korikot i Karajaan do Kinoringan it mongovit kopiondusan sid pomogunan."], ["What Do We Learn From the Great Flood?", "Nunu Tudukan Anu Tokou antad di Linusuvon?"], ["Jehovah told Noah that He was going to destroy the wicked people with a great flood.", "Boros di Yehovah si di Noa, lusuvon no dau iti pomogunan tu momunso no dit ongo ulun taraat."], ["What Do We Learn From the Great Flood?", "Nunu Tudukan Anu Tokou antad di Linusuvon?"], ["Those who take this principle to heart gain friendship with God, true happiness, and everlasting life.", "Isai nopo sumuhut prinsip diti kadapat kumoruhang di Kinoringan, kohigakan totopot, om koposizan penlaid."], ["something within your heart?", "baiko sid ginavo?"], ["The Bible says that man’s wickedness was great on the earth and that every inclination of the thoughts of his heart was only bad all the time.", "Boros di Kitab Gumazo no i karaatan do riniba sid pomogunan om i pongitungan dioti nga posurut nopo do karaatan."], ["Your example in showing love for God can deeply influence your child’s heart.", "It gama ditokou popemot samod sid Kinoringan, katanom sid ginavo dit angaanak."], ["He wants us to pray from our heart.", "Engin Yosido mintadua tokou antad sid ginavo."], ["Soon he will bring back to life those asleep in death.", "Amu no alaid, gulianon no Dau vagu it tulun minatai."], ["God wants people to enjoy life on earth.", "Engin i Kinoringan ohigak koposizan it riniba sid pomogunan."], ["After Jesus died, God restored him to life as a spirit person.", "Minatai po i Yesus, ginulian no di Kinoringan yosido sid inan do sundu."], ["What Is the Key to Happy Family Life?", "Nunu Ralan Kohigakan Songongkob?"], ["What is the meaning of life?", "Isai monguasa diti pomogunan?"], ["God is the Originator of family life.", "I Kinoringan o minonimpuun pinisavaan."], ["Satisfying answers to life’s big questions", "Panarangan totopot kanangan ko pongoduatan dit kogolivong di tokou."], ["How can God’s Word improve your life?", "Kuran boros do Kitab potolunung koposizan di tokou?"], ["While on earth, Jesus fed the hungry, healed the sick, and restored life to the dead!", "It hiza sid pomogunan, pinaakan Yesus it ulun vitilon, minongingkod di kisakit om minongogulian it ulun minatai!"], ["The first reveals the very purpose of human life —to know God, to love him, and to serve him faithfully.", "It prinsip keso monuduk potujuvan koposizan riniba, inono—tumutun do Kinoringan, manamod Dau, om sumamba Dau."], ["Today, Jehovah is preparing millions of people for life in the future Paradise on earth.", "Didino, kakalno i Yehovah posodia di jinutaan riniba mintoron sid pomogunan tavantang sid tohudi taddau."], ["Though Noah and his family eventually died, God will bring them to life again with the prospect of living forever.", "Minatai no yoti topot gulianon i vagu di Kinoringan sampai varo harapan koposizan penlaid."], ["Allowing Bible truth to guide our decisions and actions leads to a more meaningful life.", "Ong mokitunda tokou do kabanaran do Kitab hiza manganu koputusan om sid gagamaon ditokou, kadapat tokou koposizan dit lobipo avantang."], ["The Bible calls Jehovah God the source of life.", "Nokosurat sid Kitab i Kinoringan ovud do koposizan."], ["Where Can We Find Answers to Life’s Big Questions?", "Siombo Pogihiman Panarangan i Pongoduatan Kanangan ko Koposizan?"], ["Jehovah teaches us the best way of life.", "Om i Yehovah monuduk di tokou ralan koposizan banalko avantang."], ["Life in Paradise will be a delight.", "Banalko ohigak koposizan sinod pomogunan vagu."], ["How can I find happiness in life?", "Kuranku mogihim kohigakan sid koposizan?"], ["This promised future includes perfect health and everlasting life for obedient humans.", "Toliban poko ino, it sinumuhut boros do Kinoringan kadapat kosihatan dot tavatang om koposizan penlaid."], ["Likewise, to discover the ingredients for a happy family life, we do well to look to Jehovah, the Originator of the family arrangement.", "Yadnokeno, ong mogihim ralan kohigakan songongkob, tumoronong tokou sid Kinoringan Yehovah, i minonimpuun pinisavaan."], [" The One who gave life to all living creatures is certainly capable of restoring life to someone who has died.", "It minanahak koposizan tantuko kadapat mongogulian it minatai."], ["Your hope of enjoying everlasting life depends on your getting to know God.", "Ralan kumaa koposizan penlaid aso vokon, inoinga suvaiko tumutun banal do Kinoringan."], ["In a coming new world, life in perfect health and happiness.", "Kadapat tokou koposizan it ohigak om amu no mongoruol sid pomogunan vagu."], ["How can I improve the quality of my family life?", "Kuran ku mangatag dit koposizan suvang ongkob ku?"], ["When the dead return to life, whom do you especially want to see?", "Ong gumulian no vagu it ongo ulun minatai, isai it banalko tisamung ko?"], ["It rained for 40 days and 40 nights, and the water covered all the earth.", "Dinumarun no 40 tinadahan, adau om sodop koloido om notopuan no vaig it pomogunan."], ["A son has been given to us; and the government will rest on his shoulder.", "Nitahak-no sid di tokou iso ot anak do kusai, om i karajaan nga pentoron sid kazab dau."], ["Jehovah God created the stars as well as the earth and all that is on it.", "Yehovah minongurug dit avan om tana om sokoviai it suvang dau."], ["Have a safe journey on your way home.", "Umbasi-basi mamanau ong muli ko no biano."], ["You don't tell me that you mana pee untill you urinated at your pants.", "Minomoros ko nga amu do tisobu ko sampai nokosobu ko sinod suval nu."], ["Let's eat, I have a manggo salad.", "Makan tokou, varo dinonsul ku do mampalam."], ["No more salt to make the savoury dish.", "Navi ot asin, ino pogi amu no osin ino taduk dino."], ["I wanna watch them slaughter the buffalo.", "Mimot oku po dioti mangagaraas dilo karabau."], ["You baby name is sound alike my name.", "Kasangai ngaran ku ong ino ngaran dot anak nu."], ["I can't recognise well each of you.", "Miluu kou songobpinai mai. Mad, amu osodirizan ku ikou.Your siblings look identical."], ["There is no one beauty like Mundari in the kampong.", "Aso kerad kovosiho di Mundari sitid kampung diti."], ["Stand beside Anak, Who is taller between you two?", "Rompok po di Anak, Isai naru dikou duvo?"], ["Your children is alike you.", "Luu nu ilot vuros dot anak nu hodi."], ["A pillow without a pillowcase feels dirty to her.", "Asakahan yalo, ong aso sarung i bantal dau."], ["I disgusted eating fish.", "Abangat oku mangakan sada."], ["Eat untiil you satisfied, don't be shy.", "Pising vizau no makan, kada kekum-ikum."], ["I would like to take your puppy if you willing to give it to me.", "Onuvon ku ino duku dikou ong kozuan dikou patahak."], ["If you are poor, don't take a second wife, or the children will starve.", "Kadan magapid ong mosikim, lumikop dati anak dot ulun."], ["I would like to imatate her in making a breads.", "Mamit oku dialo monuluw tinggol."], ["Drunken person cannot be controled.", "Amu ma opusus ong moginuhod o magavuk oi."], ["Next week I will take my day off, will going back to my village.", "Sumuti oku ong minggu rumikot, muli opku sid kampung."], ["Please take off this stone on my feet.", "Lungkabo po dikou dohon iti vatu, nodsitan iti hakod ku."], ["I will bring umbrella, maybe it will raining soon.", "Mongovit oku po do pazung tu dumarun dati."], ["Your future father-in-law is my uncle.", "Amazon ku ilo ama dilo sovoon nu dilo."], ["She fainted at the road because of the hot weather.", "Novunusan yalo sid tanga ralan tu kalasu dot addau."], ["How to make a pickled star-fruit?", "Kuran gama mongodonsul diti pizas"], ["Do you understand Chiness language?", "Karahati ko noka mongining boros do Kina?"], ["Do understand what you are talking about.", "Ohorotizan-i dau nunu ino boroson nu dino."], ["What do you talking about?", "Nunu ka harati dino boroson nu dino?"], ["Why is the person naked?", "Nokuro inot ulun dino tu maba-labas?"], ["These troubles will be harder for you than what your ancestors experienced.", "Iti kosusaan diti lobi po kopogos mantadko i nabambaran dit angaaki nu."], ["The valley is good to be plant with banana.", "Avantang tanaman do punti ino napu dino."], ["Read a verse from the bible. I would love to hear it.", "Pamasa po ka ayat antad sid Kitab, tining oku."], ["Cannot fight against parents when they are giving you an advise.", "Amu kavasa sumaap ong molohing o moniag."], ["I can't climb Mt Kinabalu, I feel dizzy when I'm is very high up.", "Amu kendakod oku Nabalu ong yoku diti tu biruvokon oku ong asavat no mahi."], ["I feel dizzy when I look down from the top of a building.", "Biruvokon oku ong tumuddung no antad sid savat do bangunan."], ["I would really like to go with you when you return to America", "Banalko engin oku mozo dikau muli sid Morikan."], ["I am very happy because you take time to come and visit me.", "Ohigak oku tu nokotibang ko rumikot magandaha dohon."], ["This blanket is have urinate smell because Kondong piss on it last night.", "Apasong ogi iti timog tu nosobuvan di Kondong kosodop."], ["You smell like urine, did you piss on your short?", "Apasong ko, nokosobu ko naku sid suval nu?"]]
